Revit 2026 API

# WireTypeSet Class

---

A set that contains wire types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireTypeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WireTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class WireTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class WireTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type WireTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The WireTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireTypeSet | Initializes a new instance of the WireTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Size | Returns the number of wire types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every wire type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a wire type within the set. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a specified wire type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified wire type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace